In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

Establish a connection between Python and the Sakila database.

Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.

month: an integer representing the month for which rental data is to be retrieved.

year: an integer representing the year for which rental data is to be retrieved.
The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [7]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [8]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [9]:
from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM actor')
    result = connection.execute(query)

result

In [10]:
def rentals_month(engine,month,year):
    with engine.connect() as connection:
        txt = f'''select *,
                  year(rental_date) as 'year',
                  month(rental_date) as 'month'
                  from rental
                  where year(rental_date)={year} and month(rental_date)={month};'''
        
        query = text(txt)
        result = connection.execute(query)
        df  = pd.DataFrame(result.all())
        return df

In [11]:
rentals_month(engine,5,2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,year,month
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005,5
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005,5
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005,5
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005,5
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005,5
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,2005,5
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,2005,5
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,2005,5
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2005,5
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,2005,5

In [12]:
# Develop a Python function called rental_count_month that takes the DataFrame provided by 
# rentals_month as input along with the month and year and returns a new DataFrame containing 
# the number of rentals made by each customer_id during the selected month and year.

def rental_count_month(rentals_df,month,year):
    column_name = f"rentals_{month:02d}_{year}"

    rental_counts = rentals_df.groupby('customer_id').size().reset_index(name=column_name)

    return rental_counts

In [13]:
rentals_df = rentals_month(engine, month=5, year=2005)
rental_counts_df = rental_count_month(rentals_df, month=5, year=2005)
rental_counts_df.head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [19]:
# Create a Python function called compare_rentals that takes two DataFrames as input containing 
# the number of rentals made by each customer in different months and years. 
# The function should return a combined DataFrame with a new 'difference' column, 
# which is the difference between the number of rentals in the two months.

def compare_rentals_outer(rentals_df1, rentals_df2):
    merged_df = pd.merge(rentals_df1, rentals_df2, on='customer_id', how='outer')

    merged_df = merged_df.fillna(0)

    merged_df['difference'] = merged_df.iloc[:, 1] - merged_df.iloc[:, 2]

    return merged_df

In [20]:
rentals_df1 = rental_count_month(rentals_month(engine, month=5, year=2005), month=5, year=2005)
rentals_df2 = rental_count_month(rentals_month(engine, month=6, year=2005), month=6, year=2005)

comparison_df = compare_rentals_outer(rentals_df1, rentals_df2)
comparison_df.head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1              2.0              7.0        -5.0
1            2              1.0              1.0         0.0
2            3              2.0              4.0        -2.0
3            5              3.0              5.0        -2.0
4            6              3.0              4.0        -1.0

In [21]:
def compare_rentals_inner(rentals_df1, rentals_df2):
    merged_df = pd.merge(rentals_df1, rentals_df2, on='customer_id', how='inner')

    merged_df = merged_df.fillna(0)

    merged_df['difference'] = merged_df.iloc[:, 1] - merged_df.iloc[:, 2]

    return merged_df

In [22]:
rentals_df1 = rental_count_month(rentals_month(engine, month=5, year=2005), month=5, year=2005)
rentals_df2 = rental_count_month(rentals_month(engine, month=6, year=2005), month=6, year=2005)

comparison_df = compare_rentals_inner(rentals_df1, rentals_df2)
comparison_df.head()

   customer_id  rentals_05_2005  rentals_06_2005  difference
0            1                2                7          -5
1            2                1                1           0
2            3                2                4          -2
3            5                3                5          -2
4            6                3                4          -1